{
    "nodes": [
        {
            "op": "null",
            "name": "tensor.1:0",
            "inputs": [],
            "output_names": [
                "tensor.1:0"
            ],
            "is_param": "0"
        },
        {
            "op": "tvm_op",
            "name": "fused_10_copy",
            "attrs": {
                "func_name": "fused_10_copy",
                "flatten_data": "0",
                "num_inputs": "1",
                "num_outputs": "1"
            },
            "inputs": [
                [
                    0,
                    0,
                    0
                ]
            ],
            "output_names": [
                "copy24:0"
            ]
        },
        {
            "op": "tvm_op",
            "name": "fused_9_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_copy",
            "attrs": {
                "func_name": "fused_9_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_copy",
                "flatten_data": "0",
                "num_inputs": "1",
                "num_outputs": "1"
            },
            "inputs": [
                [
                    1,
                    0,
                    0
                ]
            ],
            "output_names": [
                "TapasModel_7/TapasEmbeddings_27/aten_select_1/Slice:0"
            ]
        },
        {
            "op": "tvm_op",
            "name": "fused_10_copy1",
            "attrs": {
                "func_name": "fused_10_copy",
                "flatten_data": "0",
                "num_inputs": "1",
                "num_outputs": "1"
            },
            "inputs": [
                [
                    0,
                    0,
                    0
                ]
            ],
            "output_names": [
                "copy25:0"
            ]
        },
        {
            "op": "tvm_op",
            "name": "fused_11_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_copy",
            "attrs": {
                "func_name": "fused_11_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_copy",
                "flatten_data": "0",
                "num_inputs": "1",
                "num_outputs": "1"
            },
            "inputs": [
                [
                    3,
                    0,
                    0
                ]
            ],
            "output_names": [
                "TapasModel_7/TapasEmbeddings_27/aten_select/Slice:0"
            ]
        },
        {
            "op": "tvm_op",
            "name": "sg_tonga0",
            "attrs": {
                "func_name": "__kelf",
                "flatten_data": "0",
                "num_inputs": "2",
                "kelf": "kelf-a.json",
                "num_outputs": "2"
            },
            "inputs": [
                [
                    2,
                    0,
                    0
                ],
                [
                    4,
                    0,
                    0
                ]
            ],
            "output_names": [
                "TapasModel_7/TapasEmbeddings_27/aten_add/add:0",
                "TapasModel_7/TapasEmbeddings_27/aten_view_1/Reshape:0"
            ]
        }
    ],
    "arg_nodes": [
        0
    ],
    "heads": [
        [
            5,
            0,
            0
        ],
        [
            5,
            1,
            0
        ]
    ],
    "attrs": {
        "shape": [
            "list_shape",
            [
                [
                    3,
                    128,
                    7
                ],
                [
                    3,
                    128,
                    7
                ],
                [
                    3,
                    128,
                    1
                ],
                [
                    3,
                    128,
                    7
                ],
                [
                    3,
                    128,
                    1
                ],
                [
                    3,
                    128
                ],
                [
                    384
                ]
            ]
        ],
        "storage_id": [
            "list_int",
            [
                0,
                1,
                2,
                1,
                3,
                1,
                4
            ]
        ],
        "dltype": [
            "list_str",
            [
                "int64",
                "int64",
                "int64",
                "int64",
                "int64",
                "int64",
                "int64"
            ]
        ]
    },
    "node_row_ptr": [
        0,
        1,
        2,
        3,
        4,
        5,
        7
    ],
    "metadata": {
        "signatures": {
            "default": {
                "inputs": {
                    "tensor.1:0": {
                        "id": 0,
                        "dtype": "int64",
                        "shape": [
                            3,
                            128,
                            7
                        ]
                    }
                },
                "outputs": {
                    "sg_tonga0": {
                        "id": 5,
                        "dtype": "int64",
                        "shape": [
                            3,
                            128
                        ]
                    }
                }
            }
        }
    }
}