{
    "nodes": [
        {
            "op": "null",
            "name": "2:0",
            "inputs": [],
            "output_names": [
                "2:0"
            ],
            "is_param": "0"
        },
        {
            "op": "tvm_op",
            "name": "sg_tonga0",
            "attrs": {
                "func_name": "__kelf",
                "flatten_data": "0",
                "num_inputs": "1",
                "kelf": "kelf-a.json",
                "num_outputs": "1"
            },
            "inputs": [
                [
                    0,
                    0,
                    0
                ]
            ],
            "output_names": [
                "TapasModel_7/TapasEmbeddings_27/aten_min/Minimum:0"
            ]
        }
    ],
    "arg_nodes": [
        0
    ],
    "heads": [
        [
            1,
            0,
            0
        ]
    ],
    "attrs": {
        "shape": [
            "list_shape",
            [
                [
                    3,
                    128
                ],
                [
                    3,
                    128
                ]
            ]
        ],
        "storage_id": [
            "list_int",
            [
                0,
                1
            ]
        ],
        "dltype": [
            "list_str",
            [
                "int64",
                "int64"
            ]
        ]
    },
    "node_row_ptr": [
        0,
        1,
        2
    ],
    "metadata": {
        "signatures": {
            "default": {
                "inputs": {
                    "2:0": {
                        "id": 0,
                        "dtype": "int64",
                        "shape": [
                            3,
                            128
                        ]
                    }
                },
                "outputs": {
                    "sg_tonga0": {
                        "id": 1,
                        "dtype": "int64",
                        "shape": [
                            3,
                            128
                        ]
                    }
                }
            }
        }
    }
}