{
    "nodes": [
        {
            "op": "null",
            "name": "tensor.1:0",
            "inputs": [],
            "output_names": [
                "tensor.1:0"
            ],
            "is_param": "0"
        },
        {
            "op": "tvm_op",
            "name": "fused_5_copy",
            "attrs": {
                "func_name": "fused_5_copy",
                "flatten_data": "0",
                "num_inputs": "1",
                "num_outputs": "1"
            },
            "inputs": [
                [
                    0,
                    0,
                    0
                ]
            ],
            "output_names": [
                "copy12:0"
            ]
        },
        {
            "op": "tvm_op",
            "name": "fused_4_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_copy",
            "attrs": {
                "func_name": "fused_4_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_strided_slice_copy",
                "flatten_data": "0",
                "num_inputs": "1",
                "num_outputs": "1"
            },
            "inputs": [
                [
                    1,
                    0,
                    0
                ]
            ],
            "output_names": [
                "TapasModel_7/TapasEmbeddings_27/aten_select/Slice:0"
            ]
        },
        {
            "op": "tvm_op",
            "name": "sg_tonga0",
            "attrs": {
                "func_name": "__kelf",
                "flatten_data": "0",
                "num_inputs": "1",
                "kelf": "kelf-a.json",
                "num_outputs": "1"
            },
            "inputs": [
                [
                    2,
                    0,
                    0
                ]
            ],
            "output_names": [
                "TapasModel_7/TapasEmbeddings_27/aten_select/Reshape:0"
            ]
        }
    ],
    "arg_nodes": [
        0
    ],
    "heads": [
        [
            3,
            0,
            0
        ]
    ],
    "attrs": {
        "shape": [
            "list_shape",
            [
                [
                    3,
                    128,
                    7
                ],
                [
                    3,
                    128,
                    7
                ],
                [
                    3,
                    128,
                    1
                ],
                [
                    3,
                    128
                ]
            ]
        ],
        "storage_id": [
            "list_int",
            [
                0,
                1,
                2,
                1
            ]
        ],
        "dltype": [
            "list_str",
            [
                "int64",
                "int64",
                "int64",
                "int64"
            ]
        ]
    },
    "node_row_ptr": [
        0,
        1,
        2,
        3,
        4
    ],
    "metadata": {
        "signatures": {
            "default": {
                "inputs": {
                    "tensor.1:0": {
                        "id": 0,
                        "dtype": "int64",
                        "shape": [
                            3,
                            128,
                            7
                        ]
                    }
                },
                "outputs": {
                    "sg_tonga0": {
                        "id": 3,
                        "dtype": "int64",
                        "shape": [
                            3,
                            128
                        ]
                    }
                }
            }
        }
    }
}