{
    "nodes": [
        {
            "op": "null",
            "name": "0:0",
            "inputs": [],
            "output_names": [
                "0:0"
            ],
            "is_param": "0"
        },
        {
            "op": "null",
            "name": "1:0",
            "inputs": [],
            "output_names": [
                "1:0"
            ],
            "is_param": "0"
        },
        {
            "op": "tvm_op",
            "name": "sg_tonga0",
            "attrs": {
                "func_name": "__kelf",
                "flatten_data": "0",
                "num_inputs": "2",
                "kelf": "kelf-a.json",
                "num_outputs": "2"
            },
            "inputs": [
                [
                    0,
                    0,
                    0
                ],
                [
                    1,
                    0,
                    0
                ]
            ],
            "output_names": [
                "TapasModel_7/TapasEmbeddings_27/aten_view/Reshape:0",
                "copy1:0"
            ]
        }
    ],
    "arg_nodes": [
        0,
        1
    ],
    "heads": [
        [
            2,
            0,
            0
        ],
        [
            2,
            1,
            0
        ]
    ],
    "attrs": {
        "shape": [
            "list_shape",
            [
                [
                    196608
                ],
                [
                    3,
                    512
                ],
                [
                    3,
                    65536
                ],
                [
                    3,
                    512
                ]
            ]
        ],
        "storage_id": [
            "list_int",
            [
                0,
                1,
                2,
                3
            ]
        ],
        "dltype": [
            "list_str",
            [
                "int64",
                "int64",
                "int64",
                "int64"
            ]
        ]
    },
    "node_row_ptr": [
        0,
        1,
        2,
        4
    ],
    "metadata": {
        "signatures": {
            "default": {
                "inputs": {
                    "0:0": {
                        "id": 0,
                        "dtype": "int64",
                        "shape": [
                            196608
                        ]
                    },
                    "1:0": {
                        "id": 1,
                        "dtype": "int64",
                        "shape": [
                            3,
                            512
                        ]
                    }
                },
                "outputs": {
                    "sg_tonga0": {
                        "id": 2,
                        "dtype": "int64",
                        "shape": [
                            3,
                            65536
                        ]
                    }
                }
            }
        }
    }
}